Tekla Open API Reference for Tekla Structures 2025
NumericConstantFilterExpression Constructor (UInt64)
 Initializes a new instance of the NumericConstantFilterExpression class.
 Namespace: Tekla.Structures.Filtering
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public NumericConstantFilterExpression(
	ulong Value
)
Public Sub New (
	Value As ULong
)
Parameters
Value
Type: System.UInt64
The value to represent.
See Also
Reference
NumericConstantFilterExpression Class
NumericConstantFilterExpression Overload
Tekla.Structures.Filtering Namespace